wegam/STM32F1xWorkSpace/Driver/Components/SCR/MMC_SD.C
//#include "sys.h"
#include "MMC_SD.h"
#include "stm32f10x_spi.h"
//#include "spi.h"
//#include "usart.h"	



//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK MiniSTM32开发板
//SD卡 驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//修改日期:2014/3/13
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 广州市星翼电子科技有限公司 2009-2019
//All rights reserved									  
//////////////////////////////////////////////////////////////////////////////////



unsigned char  SD_Type=0;//SD卡的类型
SPIDef		*pSDSPI = 0;       //内部驱动使用，不可删除
////////////////////////////////////移植修改区///////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
//取消选择,释放SPI总线
void SD_DisSelect(void)
{
	SD_CS=1;
 	SD_SPI_ReadWriteByte(0xff);//提供额外的8个时钟
}
//选择sd卡,并且等待卡准备OK
//返回值:0,成功;1,失败;
unsigned char SD_Select(void)
{
	SD_CS=0;
//	if(SD_WaitReady()==0)
//    return 0;//等待成功
//	SD_DisSelect();
	return 1;//等待失败
}
/*******************************************************************************
*函数名			:	SD_SendCmd
*功能描述		:	向SD卡发送一个命令
*输入				: cmd 命令
              arg 命令参数
              crc crc校验值
*返回值			:	SD卡返回的响应
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
//等待卡准备好
//返回值:0,准备好了;其他,错误代码
unsigned char SD_WaitReady(void)
{
	u32 t=0;
	do
	{
		if(SD_SPI_ReadWriteByte(0XFF)==0XFF)
      return 0;//OK
		t++;		  	
	}while(t<0XFFFFFF);//等待 
	return 1;
}
/*******************************************************************************
*函数名			:	SD_GetResponse
*功能描述		:	等待SD卡回应
*输入				: Response:要得到的回应值
*返回值			:	0,成功;其他,失败;
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char SD_GetResponse(u8 Response)
{
	u16 Count=0xFFFF;//等待次数	   						  
	while ((SD_SPI_ReadWriteByte(0XFF)!=Response)&&Count)Count--;//等待得到准确的回应  	  
	if (Count==0)return MSD_RESPONSE_FAILURE;//得到回应失败   
	else return MSD_RESPONSE_NO_ERROR;//正确回应
}
/*******************************************************************************
*函数名			:	SD_RecvData
*功能描述		:	从sd卡读取一个数据包的内容
*输入				: buf:数据缓存区
              len:要读取的数据长度
*返回值			:	0,成功;其他,失败;
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char SD_RecvData(u8*buf,u16 len)
{			  	  
	if(SD_GetResponse(0xFE))
    return 1;//等待SD卡发回数据起始令牌0xFE
    while(len--)//开始接收数据
    {
        *buf=SPI1_ReadWriteByte(0xFF);
        buf++;
    }
    //下面是2个伪CRC（dummy CRC）
    SD_SPI_ReadWriteByte(0xFF);
    SD_SPI_ReadWriteByte(0xFF);									  					    
    return 0;//读取成功
}
/*******************************************************************************
*函数名			:	SD_SendBlock
*功能描述		:	向sd卡写入一个数据包的内容 512字节
*输入				: buf:数据缓存区
              cmd:指令
*返回值			:	0,成功;其他,失败;
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char SD_SendBlock(u8*buf,u8 cmd)
{	
	u16 t;		  	  
	if(SD_WaitReady())return 1;//等待准备失效
	SD_SPI_ReadWriteByte(cmd);
	if(cmd!=0XFD)//不是结束指令
	{
		for(t=0;t<512;t++)SPI1_ReadWriteByte(buf[t]);//提高速度,减少函数传参时间
	    SD_SPI_ReadWriteByte(0xFF);//忽略crc
	    SD_SPI_ReadWriteByte(0xFF);
		t=SD_SPI_ReadWriteByte(0xFF);//接收响应
		if((t&0x1F)!=0x05)return 2;//响应错误									  					    
	}						 									  					    
    return 0;//写入成功
}
/*******************************************************************************
*函数名			:	SD_SendCmd
*功能描述		:	向SD卡发送一个命令
*输入				: cmd 命令
              arg 命令参数
              crc crc校验值
*返回值			:	SD卡返回的响应
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char SD_SendCmd(u8 cmd, u32 arg, u8 crc)
{
  u8 r1 = 0;	
	u8 Retry=0;
  //=========================片选
	SD_DisSelect();     //取消上次片选
  SD_Select();        //片选使能
	//=========================发送命令
  SD_SPI_ReadWriteByte(cmd | 0x40);//分别写入命令
  SD_SPI_ReadWriteByte(arg >> 24);
  SD_SPI_ReadWriteByte(arg >> 16);
  SD_SPI_ReadWriteByte(arg >> 8);
  SD_SPI_ReadWriteByte(arg);	  
  SD_SPI_ReadWriteByte(crc); 
  //=========================根据发送的命令返回的响应参数判断结果
  //-------------------------复位命令：返回0x01表示响应成功
  if(CMD0 ==  cmd)
  {
    for(Retry=0;Retry<0xFF;Retry++)
    {
      r1=SD_SPI_ReadWriteByte(0xFF);
      if(0x01 ==  r1)   //响应0x01表示复位响应成功
        return r1;
    }
  }
  //-------------------------停止数据传输
	if(cmd==CMD12)
    SD_SPI_ReadWriteByte(0xff);//Skip a stuff byte when stop reading
    //等待响应，或超时退出
	Retry=0XFF;
	do
	{
		r1=SD_SPI_ReadWriteByte(0xFF);
	}while((r1&0X80) && Retry--);	 
	//返回状态值
  return r1;
}
/*******************************************************************************
*函数名			:	SD_GetCID
*功能描述		:	获取SD卡的CID信息，包括制造商信息
*输入				: cid_data(存放CID的内存地址，至少16Byte）
*返回值			:	0：NO_ERR
              1：错误	
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char SD_GetCID(u8 *cid_data)
{
    u8 r1;	   
    //发CMD10命令，读CID
    r1=SD_SendCmd(CMD10,0,0x01);
  if(r1==0x00)
	{
		r1=SD_RecvData(cid_data,16);//接收16个字节的数据	 
  }
	SD_DisSelect();//取消片选
	if(r1)
    return 1;
	else
    return 0;
}
/*******************************************************************************
*函数名			:	SD_GetCSD
*功能描述		:	获取SD卡的CSD信息，包括容量和速度信息
*输入				: cid_data(存放CID的内存，至少16Byte）
*返回值			:	0：NO_ERR
              1：错误	
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char SD_GetCSD(u8 *csd_data)
{
    u8 r1;	 
    r1=SD_SendCmd(CMD9,0,0x01);//发CMD9命令，读CSD
    if(r1==0)
	{
    	r1=SD_RecvData(csd_data, 16);//接收16个字节的数据 
    }
	SD_DisSelect();//取消片选
	if(r1)
    return 1;
	else
    return 0;
}
/*******************************************************************************
*函数名			:	SD_GetSectorCount
*功能描述		:	获取SD卡的总扇区数（扇区数）--每扇区的字节数必为512，因为如果不是512，则初始化不能通过
*输入				: cid_data(存放CID的内存地址，至少16Byte）
*返回值			:	0: 取容量出错
              其他:SD卡的容量-单位KByte(扇区数/512字节)	
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
u32 SD_GetSectorCount(void)
{
  u8 csd[16];
  u32 Capacity;  
  u8 n;
	u16 csize;  					    
	//取CSD信息，如果期间出错，返回0
  if(SD_GetCSD(csd)!=0)
    return 0;	    
  //如果为SDHC卡，按照下面方式计算
  if((csd[0]&0xC0)==0x40)	 //V2.00的卡
  {	
    csize = csd[9] + ((u16)csd[8] << 8) + 1;
    Capacity = (u32)csize << 9;//得到扇区数	 		   
  }
  else//V1.XX的卡
  {	
    n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
    csize = (csd[8] >> 6) + ((u16)csd[7] << 2) + ((u16)(csd[6] & 3) << 10) + 1;
    Capacity= (u32)csize << (n - 9);//得到扇区数   
  }
  return Capacity;
}
//初始化SD卡
u8 SD_Initialize(SPIDef *SpiPort)
{
  u8 r1;      // 存放SD卡的返回值
  u16 retry;  // 用来进行超时计数
  u8 buf[4];  
  u16 i;
  pSDSPI  = SpiPort;
  //========================硬件初始化
  SPI_Initialize(pSDSPI);   //初始化GPIO
 	SD_SPI_SpeedLow();	      //设置到低速模式
  //========================发送大于74个时钟等待SD卡上电稳定  
 	for(i=0;i<10;i++)
    SD_SPI_ReadWriteByte(0XFF);//发送最少74个脉冲
  //========================发送复位命令进入IDLE状态
	retry=20;
	do
	{
		r1=SD_SendCmd(CMD0,0,0x95); //进入IDLE状态
	}while((r1!=0X01) && retry--);
 	SD_Type=0;//默认无卡
	if(r1==0X01)
	{
    //========================检查SD类型及版本
    //------------------------检查是否为SD V2.0
		if(SD_SendCmd(CMD8,0x1AA,0x87)==1)  //SD V2.0
		{
			for(i=0;i<4;i++)
        buf[i]=SD_SPI_ReadWriteByte(0XFF);	//Get trailing return value of R7 resp
			if(buf[2]==0X01&&buf[3]==0XAA)    //卡是否支持2.7~3.6V
			{
				retry=0XFFFE;
        //------------------------循环发送CMD55和CMD41直到返回0x00，使SD卡进入Ready状态
				do
				{          
					SD_SendCmd(CMD55,0,0X01);	            //发送CMD55
					r1=SD_SendCmd(CMD41,0x40000000,0X01); //发送CMD41
				}while(r1&&retry--);
        //========================鉴别SD2.0卡版本开始
        //------------------------发送CMD58获取OCR信息
				if(retry&&SD_SendCmd(CMD58,0,0X01)==0)    //鉴别SD2.0卡版本开始
				{
					for(i=0;i<4;i++)
            buf[i]=SD_SPI_ReadWriteByte(0XFF);    //得到OCR值
					if(buf[0]&0x40)
            SD_Type=SD_TYPE_V2HC;     //大容量V2.0SD卡 
					else
            SD_Type=SD_TYPE_V2MC;     //小容量V2.0SD卡 
				}
			}
		}
    else//SD V1.x/ MMC	V3
		{
			SD_SendCmd(CMD55,0,0X01);		  //发送CMD55
			r1=SD_SendCmd(CMD41,0,0X01);	//发送CMD41
			if(r1<=1)
			{		
				SD_Type=SD_TYPE_V1;
				retry=0XFFFE;
				do //等待退出IDLE模式
				{
					SD_SendCmd(CMD55,0,0X01);	    //发送CMD55
					r1=SD_SendCmd(CMD41,0,0X01);  //发送CMD41
				}while(r1&&retry--);
			}
      else//MMC卡不支持CMD55+CMD41识别
			{
				SD_Type=SD_TYPE_MMC;//MMC V3
				retry=0XFFFE;
				do //等待退出IDLE模式
				{											    
					r1=SD_SendCmd(CMD1,0,0X01);//发送CMD1
				}while(r1&&retry--);  
			}
			if(retry==0||SD_SendCmd(CMD16,512,0X01)!=0)
        SD_Type=SD_TYPE_ERR;//错误的卡
		}
	}
	SD_DisSelect();//取消片选
	SD_SPI_SpeedHigh();//高速
	if(SD_Type)
    return 0;
	else if(r1)
    return r1; 	   
	return 0xaa;//其他错误
}
/*******************************************************************************
*函数名			:	SD_ReadDisk
*功能描述		:	读SD卡扇区
*输入				: buf:数据缓存区
              sector:扇区
              cnt:扇区数
*返回值			:	0,ok;其他,失败
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char SD_ReadDisk(u8*buf,u32 sector,u8 cnt)
{
	u8 r1;
	if(SD_Type!=SD_TYPE_V2HC)
    sector <<= 9;//转换为字节地址
	if(cnt==1)
	{
		r1=SD_SendCmd(CMD17,sector,0X01);//读命令
		if(r1==0)//指令发送成功
		{
			r1=SD_RecvData(buf,512);//接收512个字节	   
		}
	}
  else
	{
		r1=SD_SendCmd(CMD18,sector,0X01);//连续读命令
		do
		{
			r1=SD_RecvData(buf,512);//接收512个字节	 
			buf+=512;  
		}while(--cnt && r1==0); 	
		SD_SendCmd(CMD12,0,0X01);	//发送停止命令
	}   
	SD_DisSelect();//取消片选
	return r1;//
}
/*******************************************************************************
*函数名			:	SD_WriteDisk
*功能描述		:	往SD卡写数据
*输入				: buf:数据缓存区
              sector:起始扇区
              cnt:扇区数
*返回值			:	0,ok;其他,失败
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char SD_WriteDisk(u8*buf,u32 sector,u8 cnt)
{
	u8 r1;
	if(SD_Type!=SD_TYPE_V2HC)sector *= 512;//转换为字节地址
	if(cnt==1)
	{
		r1=SD_SendCmd(CMD24,sector,0X01);//读命令
		if(r1==0)//指令发送成功
		{
			r1=SD_SendBlock(buf,0xFE);//写512个字节	   
		}
	}else
	{
		if(SD_Type!=SD_TYPE_MMC)
		{
			SD_SendCmd(CMD55,0,0X01);	
			SD_SendCmd(CMD23,cnt,0X01);//发送指令	
		}
 		r1=SD_SendCmd(CMD25,sector,0X01);//连续读命令
		if(r1==0)
		{
			do
			{
				r1=SD_SendBlock(buf,0xFC);//接收512个字节	 
				buf+=512;  
			}while(--cnt && r1==0);
			r1=SD_SendBlock(0,0xFD);//接收512个字节 
		}
	}   
	SD_DisSelect();//取消片选
	return r1;//
}	



//SPI1 读写一个字节
//TxData:要写入的字节
//返回值:读取到的字节
unsigned char SPI1_ReadWriteByte(u8 TxData)
{		
	return SPI_ReadWriteByteSPI(pSDSPI,TxData);			    
}
//移植时候的接口
//data:要写入的数据
//返回值:读到的数据
unsigned char SD_SPI_ReadWriteByte(u8 data)
{
//  return SPI_ReadWriteByteSPI(pSPI,data);
	return SPI1_ReadWriteByte(data);
}	  
//SD卡初始化的时候,需要低速
void SD_SPI_SpeedLow(void)
{
  pSDSPI->Port.SPIx->CR1 &= 0xFFC7;
  pSDSPI->Port.SPIx->CR1 |= SPI_BaudRatePrescaler_256;
// 	SPI1_SetSpeed(SPI_BaudRatePrescaler_256);//设置到低速模式	
}
//SD卡正常工作的时候,可以高速了
void SD_SPI_SpeedHigh(void)
{
  pSDSPI->Port.SPIx->CR1 &= 0xFFC7;
  pSDSPI->Port.SPIx->CR1 |= SPI_BaudRatePrescaler_2;
// 	SPI1_SetSpeed(SPI_BaudRatePrescaler_2);//设置到高速模式	
}



















